app/controllers/shortener_controller.rb

  def create
    @short= Short.new(original_link: params[:original_link])
    @short.original_link = @short.original_link
    @short.shortened_link = @short.shorten_link

    if @short.save
---
INSERT INTO "shorts" ("shortened_link", "original_link", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["shortened_link", "buceta"], ["original_link", "https://www.youtube.com/watch?v=ZBs1a6Y25bY"], ["created_at", "2024-03-27 03:24:50.085683"], ["updated_at", "2024-03-27 03:24:50.085683"]]

  def send_to_original
    @short = Short.find_by(shortened_link: params[:shortened_link])
---
SELECT "shorts".* FROM "shorts" WHERE "shorts"."shortened_link" = ? LIMIT ?  [["shortened_link", "9r6lggsm"], ["LIMIT", 1]]